{
  "name": "RoboDomo",
  "featured": true,
  "weight": 20,
  "repo": "https://github.com/RoboDomo",
  "image": "robodomo/logo.png",
  "headline": "IoT automation framework experimentation for developers",
  "description": "RoboDomo is an experiment that creates a universal interface for communicating with the fragmented market of IoT vendors. Using the simplicity of MQTT messages, IoT devices can interact, follow automation patterns, feed data lakes, and learn from external data. Think of it as IoT devices Tweeting each other messages to influence behavior.",
  "stack": ["node",  "docker", "react", "ionic"],
  "tags": ["iot", "mqtt", "automation"],
  "team": [
    { "name": "Michael Schwartz", "twitter": "modusschwartz" },
    { "name": "Grgur Grisogono", "twitter": "ggrgur" },
    { "name": "Sergiu Popescu", "twitter": "" },
    { "name": "Andrei Tulvan", "twitter": "" },
    { "name": "Aaron Goldman", "twitter": "" },
    { "name": "Andrew Tran", "twitter": "" }
  ],
  "route": "robodomo-iot-framework",
  "pageTitle": "RoboDomo: IoT Automation Experiment",
  "meta": [
    {
      "name": "keywords",
      "content": "iot, robodomo, home automation, iot automation, node, mqtt, docker"
    }
  ],
  "content": [
    {
      "title": "Rich IoT Dashboard Example",
      "screenshots": [{ "screen": "robodomo/Screenshot_2019-10-28_18.21.19.png" }],
      "description": "RoboDomo comes with a rich <a href=\"https://robodomo.modus.app\">IoT dashboard</a> that consumes MQTT manages to visalize the data from a responsive web application. Built with beautiful <a href=\"https://moduscreate.com/partners/ionic/\">Ionic web components</a>, this control panel subscribes to events in the IoT infrastructure and communicates information back using the same powerful MQTT protocol."
    },
    {
      "title": "Ready for Machine Learning and AI",
      "description": "<a href=\"https://github.com/RoboDomo\">RoboDomo</a> ships with a palette of containerized microservices that serve as translators between propriatery IoT vendor APIs and the universal MQTT protocol. For example, one of our specially designed microservices subscribes to MQTT messages and store them in a document database for the purposes of security auditing, tracking history, and analyzigng trends."
    },
    {
      "screenshots": [{ "screen": "robodomo/Screenshot_2019-10-28_18.25.45.png" }],
      "description": "Developers no longer need to worry about vendor-specific language. This also allows for exciting features like populating big data services for Machine Learning and prediction-based instructions to industrial and home IoT environments."
    },
    {
      "title": "Independent, Containerized, Secure",
      "description": "RoboDomo can run in the cloud or completely offline withing a firewalled infrastructure. All microservices come with Docker and Docker-compose support for easy container orchestration. "
    },
    {
      "description": "Exploring IoT? Get in touch with Modus Create's IoT experts, today!"
    }
  ],
  "structuredData": {
    "name": "RoboDomo IoT Automation Experiment",
    "operatingSystem": "Windows 7, OSX 10.6, Linux",
    "applicationCategory": "http://schema.org/Application"
  }
}
